from tupy import *

class Campo(Image):
    def __init__(self) -> None:
        self.file = 'fundo4.png' # Arquivo de imagem do tabuleiro
        self.x = 380 # Coordenada x da imagem do tabuleiro
        self.y = 230 # Coordenada y da imagem do tabuleiro
        self.casas = {
            # Coordenadas de cada casa do tabuleiro
            '1': {'x': 90, 'y': 115}, 
            '2': {'x': 162, 'y': 115}, 
            '3': {'x': 234, 'y': 115}, 
            '4': {'x': 306, 'y': 115}, 
            '5': {'x': 378, 'y': 115}, 
            '6': {'x': 450, 'y': 115}, 
            '7': {'x': 522, 'y': 115}, 
            '8': {'x': 594, 'y': 115}, 
            '9': {'x': 666, 'y': 115}, 
            '10': {'x': 738, 'y': 115},
            '11': {'x': 810, 'y': 115}, 
            '12': {'x': 810, 'y': 192}, 
            '13': {'x': 810, 'y': 269}, 
            '14': {'x': 738, 'y': 269}, 
            '15': {'x': 666, 'y': 269},
            '16': {'x': 594, 'y': 269},
            '17': {'x': 522, 'y': 269}, 
            '18': {'x': 450, 'y': 269}, 
            '19': {'x': 378, 'y': 269}, 
            '20': {'x': 306, 'y': 269}, 
            '21': {'x': 234, 'y': 269},
            '22': {'x': 162, 'y': 269}, 
            '23': {'x': 90, 'y': 269}, 
            '24': {'x': 90, 'y': 346},
            '25': {'x': 90, 'y': 423},
            '26': {'x': 162, 'y': 423},
            '27': {'x': 234, 'y': 423},
            '28': {'x': 306, 'y': 423},
            '29': {'x': 378, 'y': 423},
            '30': {'x': 450, 'y': 423},
            '31': {'x': 522, 'y': 423},
            '32': {'x': 594, 'y': 423},
            '33': {'x': 666, 'y': 423},
            '34': {'x': 740, 'y': 423},
        }
        # Dicionário que mapeia o número de cada casa para suas coordenadas